Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4c/include/sam4c4c_0.h
#include "pio/pio_sam4c4c.h"
/*@}*/

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAM4C4C */
/* ************************************************************************** */

#define IFLASH_SIZE              (0x40000u)
#define IFLASH_PAGE_SIZE         (512u)
#define IFLASH_LOCK_REGION_SIZE  (8192u)
#define IFLASH_NB_OF_PAGES       (512u)
#define IFLASH_NB_OF_LOCK_BITS   (32u)
#define IRAM0_SIZE               (0x20000u)
#define IRAM1_SIZE               (0x4000u)
#define IRAM2_SIZE               (0x2000u)
#define IRAM_SIZE                (IRAM0_SIZE+IRAM1_SIZE+IRAM2_SIZE)

#define IFLASH_CNC_ADDR  (0x01000000u) /**< Internal Flash (Code - Non Cached) base address */
#define IROM_ADDR        (0x02000000u) /**< Internal ROM base address */
#define IFLASH_CC_ADDR   (0x11000000u) /**< Internal Flash (Code - Cached) base address */
#define IRAM0_ADDR       (0x20000000u) /**< Internal RAM 0 base address */
#define IRAM1_ADDR       (0x20080000u) /**< Internal RAM 1 base address */
#define IRAM2_ADDR       (0x20100000u) /**< Internal RAM 2 base address */
#define CPKCC_ROM_ADDR   (0x20180000u) /**< CPKCC ROM base address */
#define CPKCC_RAM_ADDR   (0x20191000u) /**< CPKCC RAM base address */
#define USBFS_RAM_ADDR   (0x20200000u) /**< USB Device and Host (Master Slave) Interface RAM base address */
#define EBI_CS0_ADDR     (0x60000000u) /**< EBI Chip Select 0 base address */
#define EBI_CS1_ADDR     (0x61000000u) /**< EBI Chip Select 1 base address */
#define EBI_CS2_ADDR     (0x62000000u) /**< EBI Chip Select 2 base address */
#define EBI_CS3_ADDR     (0x63000000u) /**< EBI Chip Select 3 base address */

/* ************************************************************************** */
/*   MISCELLANEOUS DEFINITIONS FOR SAM4C4C */
/* ************************************************************************** */

#define CHIP_JTAGID       (0x05B3403FUL)
#define CHIP_CIDR         (0xA64C0CE5UL)
#define CHIP_EXID         (0x0UL)
#define NB_CH_ADC         (8UL)

/* ************************************************************************** */
/*   ELECTRICAL DEFINITIONS FOR SAM4C4C */
/* ************************************************************************** */

/* Device characteristics */
#define CHIP_FREQ_SLCK_RC_MIN           (26000UL)
#define CHIP_FREQ_SLCK_RC               (32000UL)
#define CHIP_FREQ_SLCK_RC_MAX           (39000UL)
#define CHIP_FREQ_MAINCK_RC_4MHZ        (4000000UL)
#define CHIP_FREQ_MAINCK_RC_8MHZ        (8000000UL)
#define CHIP_FREQ_MAINCK_RC_12MHZ       (12000000UL)
#define CHIP_FREQ_CPU_MAX               (120000000UL)
#define CHIP_FREQ_XTAL_32K              (32768UL)
#define CHIP_FREQ_PLLA_TYPICAL          (8192000UL) /* PLL A typical frequency output, if MULA+1=250 and based on External 32K oscillator */
#define CHIP_FREQ_PLLA_TYPICAL_MULA     (249UL) /* PLL A typical MULA */

/* Embedded Flash Write Wait State */
#define CHIP_FLASH_WRITE_WAIT_STATE     (6U)

/* Embedded Flash Read Wait State (VDDCORE set at 1.20V / VDDIO set between 2.7V to 3.6V / @ 85�C) */
#define CHIP_FREQ_FWS_0                 (21000000UL)  /**< \brief Maximum operating frequency when FWS is 0 */
#define CHIP_FREQ_FWS_1                 (42000000UL)  /**< \brief Maximum operating frequency when FWS is 1 */
#define CHIP_FREQ_FWS_2                 (63000000UL)  /**< \brief Maximum operating frequency when FWS is 2 */
#define CHIP_FREQ_FWS_3                 (85000000UL)  /**< \brief Maximum operating frequency when FWS is 3 */
#define CHIP_FREQ_FWS_4                 (106000000UL) /**< \brief Maximum operating frequency when FWS is 4 */
#define CHIP_FREQ_FWS_5                 (121000000UL) /**< \brief Maximum operating frequency when FWS is 5 */

#ifdef __cplusplus
}
#endif

/*@}*/

#endif /* _SAM4C4C_0_ */
